app/Controllers/Admin/Categoria.php

    public function index() {
        $categoriaModel = new CategoriaModel();

        $data = [
            'titulo'     => 'Categorías',
            'categorias' => $categoriaModel->find(),
        ];
---
SELECT *
FROM `categorias`