app/Controllers/Web/Catalogo.php

SELECT *
FROM `marcas`
---
    public function index()
    {
        $filtro  = $this->request->getGet();
        $session = session();

        // Si se solicita limpiar filtros, se remueven de la sesión y se redirige.
        if ($this->request->getGet('limpiar_filtros')) {
            $session->remove(['filtro_categoria', 'filtro_precio_min', 'filtro_precio_max', 'filtro_orden', 'filtro_marca']);
            return redirect()->to(route_to('web.catalogo'));
        }

        // Construir el query builder del modelo
        $builder = $this->productoModel->builder();

        // Aplicar filtros (categorías, precio, marcas, etc.)
        if (!empty($filtro['categoria'])) {
            $builder->whereIn('productos.categoria_id', $filtro['categoria']);
            $session->set('filtro_categoria', $filtro['categoria']);
        } elseif ($session->has('filtro_categoria')) {
            $filtro['categoria'] = $session->get('filtro_categoria');