app/Controllers/Web/Catalogo.php

    public function index()
    {

        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        $filtro = $this->request->getGet();
        $session = session();

        if ($this->request->getGet('limpiar_filtros')) {
            // Limpiar la sesión de filtros
            $session = session();
            $session->remove('filtro_categoria');
            $session->remove('filtro_precio_min');
            $session->remove('filtro_precio_max');
            $session->remove('filtro_orden');

            // Redirigir sin filtros (usando route_to para generar la URL correcta)
            return redirect()->to(route_to('web.catalogo'));
        }

        // Construir la consulta utilizando el Query Builder
        $builder = $productoModel->builder(); // Usar el builder del modelo para aprovechar las relaciones

        // Aplicar filtros (leer de la sesión si existen)
        if (!empty($filtro['categoria'])) {
            $builder->whereIn('productos_categorias.categoria_id', $filtro['categoria']);
            $session->set('filtro_categoria', $filtro['categoria']);
        } elseif ($session->has('filtro_categoria')) {
            $filtro['categoria'] = $session->get('filtro_categoria');
---
SELECT *
FROM `categorias`

        $data = [
            'titulo'     => 'Catalogo',
            'productos'  => $productos,
            'categorias' => $categoriaModel->find(),
---
SELECT *
FROM `categorias`