app/Controllers/Web/Usuario.php

    public function login_post()
    {
        $usuarioModel = new UsuarioModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $usuario = $usuarioModel->select('id,nombre,apellido,email,password,direccion,telefono,rol_id')
            ->orWhere('email', $email)
            ->orWhere('password', $password)
            ->first();
---
SELECT `id`, `nombre`, `apellido`, `email`, `password`, `direccion`, `telefono`, `rol_id`
FROM `usuarios`
WHERE `email` IS NULL
OR `password` IS NULL
 LIMIT 1