app/Controllers/Catalogo.php

    public function index($page = 'catalogo') {
        if (!is_file(APPPATH . 'Views/paginas/' . $page . '.php')) {
            // No se encontro la pagina.
            throw new PageNotFoundException($page);
        }

        $productoModel = new ProductoModel();

        $data = [
            'titulo'    => 'Catalogo',
            'productos' => $productoModel->find(),
        ];
---
SELECT *
FROM `productos`