app/Models/CarritoModel.php

SELECT `carritos`.*, `productos`.`nombre`, `productos`.`precio`
FROM `carritos`
JOIN `productos` ON `productos`.`id` = `carritos`.`id_producto`
WHERE `carritos`.`id_usuario` IS NULL
---
    public function obtenerCarrito($idUsuario)
    {
        $builder = $this->db->table($this->table); // Accede al builder de consultas

        // Realiza un JOIN con la tabla de productos para obtener sus detalles
        $builder->select('carritos.*, productos.nombre, productos.precio');
        $builder->join('productos', 'productos.id = carritos.id_producto');

        // Filtra por el id_usuario
        $builder->where('carritos.id_usuario', $idUsuario);

        // Obtiene los resultados y los devuelve como un array
        $query = $builder->get();