app/Models/UsuarioModel.php

SELECT `usuarios`.*, GROUP_CONCAT(CONCAT(direcciones.calle, " ", `direcciones`.`numero`, IFNULL(CONCAT(", ", direcciones.piso), ""), IFNULL(CONCAT(", `Dpto`. ", direcciones.departamento), ""))) as direcciones
FROM `usuarios`
LEFT JOIN `usuarios_direcciones` ON `usuarios_direcciones`.`usuario_id` = `usuarios`.`id`
LEFT JOIN `direcciones` ON `direcciones`.`id` = `usuarios_direcciones`.`direccion_id`
WHERE `usuarios`.`rol_id` = 2
GROUP BY `usuarios`.`id`
---
    public function obtenerTodosLosClientes()
    {
        return $this->select('usuarios.*, GROUP_CONCAT(CONCAT(direcciones.calle, " ", direcciones.numero, IFNULL(CONCAT(", ", direcciones.piso), ""), IFNULL(CONCAT(", Dpto. ", direcciones.departamento), ""))) as direcciones')
            ->join('usuarios_direcciones', 'usuarios_direcciones.usuario_id = usuarios.id', 'left')
            ->join('direcciones', 'direcciones.id = usuarios_direcciones.direccion_id', 'left')
            ->where('usuarios.rol_id', 2) // Asumiendo que el rol_id 2 es para clientes
            ->groupBy('usuarios.id')
            ->findAll();